# BuiltInFailures.LooseDimensionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LooseDimensionFailures Class
BuiltInFailures Class Members See Also
---
Failures about LooseDimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LooseDimensionFailures
```

Visual Basic
---
```text
Public NotInheritable Class LooseDimensionFailures
```

Visual C++
---
```text
public ref class LooseDimensionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..LooseDimensionFailures
# See Also
BuiltInFailures..::..LooseDimensionFailures Members
Autodesk.Revit.DB Namespace